In [1]:
import pandas as pd
import numpy as np

In [4]:
data = {
    'A': [1,2,np.nan, 4],
    'B': [5, np.nan, np.nan, 8],
    'C': [9,10,11,12]
}

df = pd.DataFrame(data)
print(df)

     A    B   C
0  1.0  5.0   9
1  2.0  NaN  10
2  NaN  NaN  11
3  4.0  8.0  12

In [6]:
print(df.isna())

# 불리안으로 바뀌고 nan인경우 true로 나옴

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False
3  False  False  False

In [10]:
# missing values 버리기
df_dropped_rows = df.dropna()

In [12]:
df_dropped_rows

     A    B   C
0  1.0  5.0   9
3  4.0  8.0  12

In [15]:
df_dropped_rows = df.dropna(thresh = 2)
df_dropped_rows

     A    B   C
0  1.0  5.0   9
1  2.0  NaN  10
3  4.0  8.0  12

In [18]:
# 평균으로 채워넣기
df.fillna(df.mean())
# 0으로 채워넣기
df.fillna(0)

     A    B   C
0  1.0  5.0   9
1  2.0  0.0  10
2  0.0  0.0  11
3  4.0  8.0  12

In [21]:
# NAN의 앞의 갚을 fill
df.fillna(method = 'ffill')

     A    B   C
0  1.0  5.0   9
1  2.0  5.0  10
2  2.0  5.0  11
3  4.0  8.0  12

In [23]:
# NAN의 뒤의 갚을 fill
df.fillna(method = 'bfill')

     A    B   C
0  1.0  5.0   9
1  2.0  8.0  10
2  4.0  8.0  11
3  4.0  8.0  12

In [24]:
# get unique value
df['A'].unique()

array([ 1.,  2., nan,  4.])

In [27]:
df['A'].nunique()

3

In [29]:
df['A'].value_counts()

1.0    1
2.0    1
4.0    1
Name: A, dtype: int64

In [32]:
data = {
    'math': [85,90,78,92,88],
    'physics': [80,85,86,92,92],
    'chemistry': [70,75,72,89,85]
}

df = pd.DataFrame(data, index=['Alice', 'Bob', 'Charlie', 'Daivid', 'Era'])
            
print(df)

         math  physics  chemistry
Alice      85       80         70
Bob        90       85         75
Charlie    78       86         72
Daivid     92       92         89
Era        88       92         85

In [38]:
row_average = df.apply(lambda row: row.mean(), axis = 1)
row_average

Alice      78.333333
Bob        83.333333
Charlie    78.666667
Daivid     91.000000
Era        88.333333
dtype: float64

In [40]:
row_average = df.apply(lambda row: row.mean(), axis = 0)
row_average

math         86.6
physics      87.0
chemistry    78.2
dtype: float64

In [42]:
df.columns

Index(['math', 'physics', 'chemistry'], dtype='object')

In [44]:
df.index

Index(['Alice', 'Bob', 'Charlie', 'Daivid', 'Era'], dtype='object')